app/Controllers/UserController.php

SELECT *
FROM `user`
ORDER BY `id` DESC
---
    public function index()
    {
        $users = $this->user->orderBy('id', 'desc')->findAll();

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
    public function show($id = null)
    {
        //
        $user = $this->user->find($id);

INSERT INTO `user` (`login`, `password`, `description`, `created_at`, `updated_at`) VALUES (' Павел', '12334', 'Чирков', '2023-06-03 19:17:25', '2023-06-03 19:17:25')
---
    public function create()
    {
        //
        $inputs = $this->validate([
            'login' => 'required|min_length[5]',
            'description' => 'required|min_length[5]',
        ]);

        if (!$inputs) {

            return view('users/create', [
                'validation' => $this->validator
            ]);
        }

        $this->user->save([
            'login' => $this->request->getVar('login'),
            'password' => '12334',
            'description' => $this->request->getVar('description'),
        ]);

SELECT *
FROM `user`
WHERE `user`.`id` = '2'
---
    public function edit($id = null)
    {
        //
        $user = $this->user->find($id);

UPDATE `user` SET `login` = 'Pavel3', `description` = '12345678123456789', `updated_at` = '2023-02-01 11:37:05'
WHERE `user`.`id` IN ('3')
---
    public function update($id = null)
    {
        //
        $inputs = $this->validate([
            'login' => 'required|min_length[5]',
            'description' => 'required|min_length[5]',
        ]);

        if (!$inputs) {
            return view('user/create', [
                'validation' => $this->validator
            ]);
        }

        $this->user->save([
            'id' => $id,
            'login' => $this->request->getVar('login'),
            'description'  => $this->request->getVar('description')
        ]);